// Домашня робота.
'use strict' 

// адача №1
// Що потрапить в консоль?

// let someVar = 0;
// ++someVar;

// if (someVar) {
// 	console.log(someVar);
// }

// відповідь:
// у console.log(someVar);   // 1; Спочатку змінна збільшиться на одиницю, потім потрапить у консоль(інкремент, префіксна форма).
// --------------------------------------------------------------------------------------------


// Задача №2
// За допомогою циклу FOR виведіть в консоль 10 рядків:
// Пункт №1
// Пункт №2
// і т.д.

// відповідь: 
// створюємо цикл, де умовою буде початок: де і = 1; кількість ітерацій: де і <= 10; i при умові true, змінна буде збільшуватись на одиницю(інкримент + ).
// Значення присвоюєм у змінну showPoints, змінну виводимо у консоль.
// 
// for (let i = 1; i <= 10; ++i) {
//     const showPoints = `Пункт №${i}`;
//     console.log(showPoints);
// }
// --------------------------------------------------------------------------------------------


// Задача №3
// Що потрапить в консоль ?
// if (2 * 20 <= 10 || 30 / 2 < 5 && 10 <= "10" || 20 === "20") {
// 	console.log('000');
// }

// let result = ( 2 * 20 <= 10 || 30 / 2 < 5 && 10 <= "10" || 20 === "20")    // умову присвоюємо змінній result, виводимо в console.
//     console.log(result);

// відповідь: 1.)  ( 2 * 20 <= 10 || false || 20 === "20" );
//            2.)  ( false || false || false );
//            3.)  console.log(result);                                      //  false.
// ------------------------------------------------------------------------------------------------


// Задача №4
// Створіть функцію, яка повертає результат ділення числа a на число b з додаванням рядка "Результат ділення: "
// Викличте функцію передаючі різні значення, у тому числі не передаючи зовсім.
// Функція не має повертати NaN, Infinite або помилку 

// відповідь:

// function getDivision(a, b) {                              // створюемо ф-ю,з двома аргументами;                   
//     let result = a / b;                                   // дію функції присвоюємо змінній result;
//     if( Number.isNaN(a) || !Number.isFinite(a)            // Number.isNaN(a) - метод,який повертає true, якщо аргумент належить до типу number, і має значення NaN;
//         || Number.isNaN(b) || !Number.isFinite(b)         // Number.isFinite(a) - м-д, який перевіряє, чи належить аргумент до типу number,і якщо так,перевіряє, чи не є NaN/Infiniti/-Infiniti;
//         || b === 0) {                                     // якщо умова true, то return (`Невірні вхідні параметри!`);
//         return (`Невірні вхідні параметри!`);             // якщо інакше, то повертає: (`Результат ділення: ${result}`);
//     } else {
//         return (`Результат ділення: ${result}`);
//     }                    
// }
// console.log(getDivision(6,55));
// console.log(getDivision(8,0));
// console.log(getDivision(6,8));
// console.log(getDivision(6,' '));
// console.log(getDivision('66',0));
// console.log(getDivision());
// ----------------------------------------------------------

// Задача №5
// Створіть масив даних - 5 елементів, один з яких число 10
// Обробіть масив за допомогою методу перебору
// Перевіряйте елемент на відповідність числу 10, та у разі відповідності, виводьте в консоль

// відповідь: 

// let someArray = ['CSS', 'JS','HTML', 10, true ]; //масив даних;

// someArray.forEach((value, index) => {            //метод перебоу масиву(forEach);
//     if(someArray.includes(10)) {                 //перевірка елемента на відповідність числу 10;
//         console.log(value, index);               //вивод в консоль.
//     }  
// });

//---------------------------------------------------------------